[
  {
    "title": "Undergraduate Programs",
    "subtitle": "The objects of our undergraduate programs are to",
    "objectives": [
      "Teach undergraduates how to practice computers effectively, innovatively, and intelligently;",
      "Clarify computer science as a multidimensional, humanistic discipline of problem solving;",
      "Offer state of the art prospectuses to the students in both technical and scientific knowledge for the professional and academic;",
      "Inspire and contribute in interdisciplinary undergraduate scholastic opportunities;",
      "Demonstrate scholars how to acquire new knowledge, autonomously, in a world that varies with ever-growing rapidity;",
      "Provide empirical learning opportunities to the students and educate an accumulative amount of computer science undergraduates to face the upward demands of the national and international economy;",
      "An ability to use the techniques, skills, and modern engineering tools necessary for computer engineering practice;",
      "An ability to communicate effectively both in an oral and written form."
    ]
  },
  {
    "title": "Graduate Programs",
    "subtitle": "The objectives of our MS, MPhil and PhD graduate programs are to",
    "objectives": [
      "Offer a great excellence flexible graduate programme with an emphasis in Intelligent Systems;",
      "Encourage and contribute in interdisciplinary undergraduate scholastic opportunities at JnU;",
      "Teach our graduate students how to spread the boundaries of computer science knowledge;",
      "Maintain excellent faculty research curriculums;",
      "Increase the number of graduate student body and their quality;",
      "Become successful entrepreneurs and managers and have a broad knowledge and wide range of interests;",
      "Are valuable members of their general community and take a leadership role in their chosen field;",
      "An additional objective of our MPhil and PhD program is to help our students become state-of-the-art scholars."
    ]
  },
  {
    "title": "Faculty",
    "subtitle": "provide sufficient number of faculty members to ensure viability for our undergraduate and graduate programs, appropriate with increases in student hours taught. To provide high-quality research, teaching, and service establish a flexible and sustainable workload procedure and enables us to recruit and maintain top-quality faculty."
  },
  {
    "title": "Infrastructure",
    "subtitle": "confirm that we have adequate class room, lab facility, office and meeting spaces and essential infrastructure, including hardware and software, to support the events required to achieve our objectives."
  },
  {
    "title": "Departmental operations",
    "subtitle": "make sure that departmental programs activate smoothly and efficiently, with a highlighting on make straight our operations and activities with proactive scheduling to accomplish our goals."
  }
]
